setup/tsung/escloadtest.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/Users/calebjohnston/Downloads/tsung-1.5.1/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" version="1.0">
	<clients>
		<client host="localhost" use_controller_vm="true"/>
	</clients>
	<servers>
		<server host="10.130.5.96" port="5222" type="tcp"/>
	</servers>
	<monitoring>
		<monitor host="10.130.5.96" type="snmp">
			<snmp version="v2" community="esc">
     </snmp>
		</monitor>
	</monitoring>
	<load duration="30" unit="minute" loop="100">
		<arrivalphase phase="1" duration="1" unit="second">
			<users maxnumber="30" arrivalrate="30" unit="second"/>
		</arrivalphase>
	</load>
	<options>
		<option type="ts_jabber" name="global_number" value="30"/>
		<option type="ts_jabber" name="userid_max" value="30"/>
		<option type="ts_jabber" name="domain" value="esc-game-server.local"/>
		<option type="ts_jabber" name="username" value="tsung"/>
		<option type="ts_jabber" name="passwd" value="tsung"/>
	</options>
	<sessions>
		<session bidi="true" probability="100" name="sasl" type="ts_jabber">
			<request>
				<jabber type="connect" ack="local"/>
			</request>
			<thinktime value="25"/>
			<transaction name="authenticate">
				<request>
					<jabber type="auth_sasl" ack="local"/>
				</request>
				<request>
					<jabber type="connect" ack="local"/>
				</request>
				<request>
					<jabber type="auth_sasl_bind" ack="local"/>
				</request>
				<request>
					<jabber type="auth_sasl_session" ack="local"/>
				</request>
			</transaction>
			<request>
				<jabber type="presence:initial" ack="no_ack"/>
			</request>
			<thinktime value="30"/>
			<repeat name="mainloop" max_repeat="200">
				<for from="1" to="1000000" var="counter">
					<transaction name="chatmessages">
						<request>
							<dyn_variable name="result" re="Result: (.*)"/>
							<jabber type="chat" ack="no_ack" size="128" destination="online"/>
						</request>
						<thinktime value="0.0025"/>
					</transaction>
				</for>
				<until var="result" eq="5"/>
			</repeat>
			<request>
				<jabber type="close" ack="no_ack"/>
			</request>
		</session>
	</sessions>
</tsung>